export const mapStyle = [
    {
        "featureType": "administrative.country",
        "elementType": "geometry",
        "stylers": [
            {
                "visibility": "simplified"
            },
            {
                "hue": "#ff0000"
            }
        ]
    }
];

export const subDistrict = [
    // อำเภอเมืองเชียงราย
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล เวียง', name: 'เวียง' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล รอบเวียง', name: 'รอบเวียง' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล บ้านดู่', name: 'บ้านดู่' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล นางแล', name: 'นางแล' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล แม่ข้าวต้ม', name: 'แม่ข้าวต้ม' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล แม่ยาว', name: 'แม่ยาว' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล สันทราย', name: 'สันทราย' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล แม่กรณ์', name: 'แม่กรณ์' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ห้วยชมภู', name: 'ห้วยชมภู' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ห้วยสัก', name: 'ห้วยสัก' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ริมกก', name: 'ริมกก' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ดอยลาน', name: 'ดอยลาน' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ป่าอ้อดอนไชย', name: 'ป่าอ้อดอนไชย' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ท่าสาย', name: 'ท่าสาย' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ดอยฮาง', name: 'ดอยฮาง' },
    { district: 'อำเภอเมืองเชียงราย', key: 'ตำบล ท่าสุด', name: 'ท่าสุด' },

    // อำเภอ พาน
    { district: 'อำเภอ พาน', key: 'ตำบล สันมะเค็ด', name: 'สันมะเค็ด' },
    { district: 'อำเภอ พาน', key: 'ตำบล แม่อ้อ', name: 'แม่อ้อ' },
    { district: 'อำเภอ พาน', key: 'ตำบล ธารทอง', name: 'ธารทอง' },
    { district: 'อำเภอ พาน', key: 'ตำบล สันติสุข', name: 'สันติสุข' },
    { district: 'อำเภอ พาน', key: 'ตำบล ดอยงาม', name: 'ดอยงาม' },
    { district: 'อำเภอ พาน', key: 'ตำบล หัวง้ม', name: 'หัวง้ม' },
    { district: 'อำเภอ พาน', key: 'ตำบล เจริญเมือง', name: 'เจริญเมือง' },
    { district: 'อำเภอ พาน', key: 'ตำบล ป่าหุ่ง', name: 'ป่าหุ่ง' },
    { district: 'อำเภอ พาน', key: 'ตำบล ม่วงคำ', name: 'ม่วงคำ' },
    { district: 'อำเภอ พาน', key: 'ตำบล ทรายขาว', name: 'ทรายขาว' },
    { district: 'อำเภอ พาน', key: 'ตำบล สันกลาง', name: 'สันกลาง' },
    { district: 'อำเภอ พาน', key: 'ตำบล แม่เย็น', name: 'แม่เย็น' },
    { district: 'อำเภอ พาน', key: 'ตำบล เมืองพาน', name: 'เมืองพาน' },
    { district: 'อำเภอ พาน', key: 'ตำบล ทานตะวัน', name: 'ทานตะวัน' },
    { district: 'อำเภอ พาน', key: 'ตำบล เวียงห้าว', name: 'เวียงห้าว' },

    // อำเภอ แม่สาย
    { district: 'อำเภอ แม่สาย', key: 'ตำบล แม่สาย', name: 'แม่สาย' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล ห้วยไคร้', name: 'ห้วยไคร้' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล เกาะช้าง', name: 'เกาะช้าง' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล โป่งผา', name: 'โป่งผา' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล ศรีเมืองชุม', name: 'ศรีเมืองชุม' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล เวียงพางคำ', name: 'เวียงพางคำ' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล บ้านด้าย', name: 'บ้านด้าย' },
    { district: 'อำเภอ แม่สาย', key: 'ตำบล โป่งงาม', name: 'โป่งงาม' },    
    
    // อำเภอ แม่จัน
    { district: 'อำเภอ แม่จัน', key: 'ตำบล แม่จัน', name: 'แม่จัน' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล จันจว้า', name: 'จันจว้า' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล แม่คำ', name: 'แม่คำ' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล ป่าซาง', name: 'ป่าซาง' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล สันทราย', name: 'สันทราย' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล ท่าข้าวเปลือก', name: 'ท่าข้าวเปลือก' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล ป่าตึง', name: 'ป่าตึง' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล แม่ไร่', name: 'แม่ไร่' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล ศรีค้ำ', name: 'ศรีค้ำ' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล จันจว้าใต้', name: 'จันจว้าใต้' },
    { district: 'อำเภอ แม่จัน', key: 'ตำบล จอมสวรรค์', name: 'จอมสวรรค์' },

     // อำเภอ เทิง
     { district: 'อำเภอ เทิง', key: 'ตำบล เวียง', name: 'เวียง' },
     { district: 'อำเภอ เทิง', key: 'ตำบล งิ้ว', name: 'งิ้ว' },
     { district: 'อำเภอ เทิง', key: 'ตำบล ปล้อง', name: 'ปล้อง' },
     { district: 'อำเภอ เทิง', key: 'ตำบล แม่ลอย', name: 'แม่ลอย' },
     { district: 'อำเภอ เทิง', key: 'ตำบล เชียงเคี่ยน', name: 'เชียงเคี่ยน' },
     { district: 'อำเภอ เทิง', key: 'ตำบล ตับเต่า', name: 'ตับเต่า' },
     { district: 'อำเภอ เทิง', key: 'ตำบล หงาว', name: 'หงาว' },
     { district: 'อำเภอ เทิง', key: 'ตำบล สันทรายงาม', name: 'สันทรายงาม' },
     { district: 'อำเภอ เทิง', key: 'ตำบล ศรีดอนไชย', name: 'ศรีดอนไชย' },
     { district: 'อำเภอ เทิง', key: 'ตำบล หนองแรด', name: 'หนองแรด' },

     // อำเภอ แม่สรวย
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล แม่สรวย', name: 'แม่สรวย' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล ป่าแดด', name: 'ป่าแดด' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล แม่พริก', name: 'แม่พริก' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล ศรีถ้อย', name: 'ศรีถ้อย' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล ท่าก๊อ', name: 'ท่าก๊อ' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล วาวี', name: 'วาวี' },
     { district: 'อำเภอ แม่สรวย', key: 'ตำบล เจดีย์หลวง', name: 'เจดีย์หลวง' },

     // อำเภอ แม่ฟ้าหลวง
     { district: 'อำเภอ แม่ฟ้าหลวง', key: 'ตำบล เทอดไทย', name: 'เทอดไทย' },
     { district: 'อำเภอ แม่ฟ้าหลวง', key: 'ตำบล แม่สลองใน', name: 'แม่สลองใน' },
     { district: 'อำเภอ แม่ฟ้าหลวง', key: 'ตำบล แม่สลองนอก', name: 'แม่สลองนอก' },
     { district: 'อำเภอ แม่ฟ้าหลวง', key: 'ตำบล แม่ฟ้าหลวง', name: 'แม่ฟ้าหลวง' },

     // อำเภอ เวียงป่าเป้า
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล สันสลี', name: 'สันสลี' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล เวียง', name: 'เวียง' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล บ้านโป่ง', name: 'บ้านโป่ง' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล ป่างิ้ว', name: 'ป่างิ้ว' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล เวียงกาหลง', name: 'เวียงกาหลง' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล แม่เจดีย์', name: 'แม่เจดีย์' },
     { district: 'อำเภอ เวียงป่าเป้า', key: 'ตำบล แม่เจดีย์ใหม่', name: 'แม่เจดีย์ใหม่' },

     // อำเภอ เชียงของ
     { district: 'อำเภอ เชียงของ', key: 'ตำบล เวียง', name: 'เวียง' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล สถาน', name: 'สถาน' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล ครึ่ง', name: 'ครึ่ง' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล บุญเรือง', name: 'บุญเรือง' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล ห้วยซ้อ', name: 'ห้วยซ้อ' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล ศรีดอนชัย', name: 'ศรีดอนชัย' },
     { district: 'อำเภอ เชียงของ', key: 'ตำบล ริมโขง', name: 'ริมโขง' },

     // อำเภอ เชียงแสน
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล เวียง', name: 'เวียง' },
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล ป่าสัก', name: 'ป่าสัก' },
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล บ้านแซว', name: 'บ้านแซว' },
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล ศรีดอนมูล', name: 'ศรีดอนมูล' },
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล แม่เงิน', name: 'แม่เงิน' },
     { district: 'อำเภอ เชียงแสน', key: 'ตำบล โยนก', name: 'โยนก' },

     // อำเภอ เวียงชัย
     { district: 'อำเภอ เวียงชัย', key: 'ตำบล เวียงชัย', name: 'เวียงชัย' },
     { district: 'อำเภอ เวียงชัย', key: 'ตำบล ผางาม', name: 'ผางาม' },
     { district: 'อำเภอ เวียงชัย', key: 'ตำบล เวียงเหนือ', name: 'เวียงเหนือ' },
     { district: 'อำเภอ เวียงชัย', key: 'ตำบล ดอนศิลา', name: 'ดอนศิลา' },
     { district: 'อำเภอ เวียงชัย', key: 'ตำบล เมืองชุม', name: 'เมืองชุม' },

     // อำเภอ ป่าแดด
     { district: 'อำเภอ ป่าแดด', key: 'ตำบล ป่าแดด', name: 'ป่าแดด' },
     { district: 'อำเภอ ป่าแดด', key: 'ตำบล ป่าแงะ', name: 'ป่าแงะ' },
     { district: 'อำเภอ ป่าแดด', key: 'ตำบล สันมะค่า', name: 'สันมะค่า' },
     { district: 'อำเภอ ป่าแดด', key: 'ตำบล โรงช้าง', name: 'โรงช้าง' },
     { district: 'อำเภอ ป่าแดด', key: 'ตำบล ศรีโพธิ์เงิน', name: 'ศรีโพธิ์เงิน' },

     // อำเภอ พญาเม็งราย
     { district: 'อำเภอ พญาเม็งราย', key: 'ตำบล แม่เปา', name: 'แม่เปา' },
     { district: 'อำเภอ พญาเม็งราย', key: 'ตำบล แม่ต๋ำ', name: 'แม่ต๋ำ' },
     { district: 'อำเภอ พญาเม็งราย', key: 'ตำบล ไม้ยา', name: 'ไม้ยา' },
     { district: 'อำเภอ พญาเม็งราย', key: 'ตำบล เม็งราย', name: 'เม็งราย' },
     { district: 'อำเภอ พญาเม็งราย', key: 'ตำบล ตาดควัน', name: 'ตาดควัน' },

     // อำเภอ เวียงแก่น
     { district: 'อำเภอ เวียงแก่น', key: 'ตำบล ม่วงยาย', name: 'ม่วงยาย' },
     { district: 'อำเภอ เวียงแก่น', key: 'ตำบล ปอ', name: 'ปอ' },
     { district: 'อำเภอ เวียงแก่น', key: 'ตำบล หล่ายงาว', name: 'หล่ายงาว' },
     { district: 'อำเภอ เวียงแก่น', key: 'ตำบล ท่าข้าม', name: 'ท่าข้าม' },

     // อำเภอ ขุนตาล
     { district: 'อำเภอ ขุนตาล', key: 'ตำบล ต้า', name: 'ต้า' },
     { district: 'อำเภอ ขุนตาล', key: 'ตำบล ป่าตาล', name: 'ป่าตาล' },
     { district: 'อำเภอ ขุนตาล', key: 'ตำบล ยางฮอม', name: 'ยางฮอม' },

     // อำเภอ แม่ลาว
     { district: 'อำเภอ แม่ลาว', key: 'ตำบล ดงมะดะ', name: 'ดงมะดะ' },
     { district: 'อำเภอ แม่ลาว', key: 'ตำบล จอมหมอกแก้ว', name: 'จอมหมอกแก้ว' },
     { district: 'อำเภอ แม่ลาว', key: 'ตำบล บัวสลี', name: 'บัวสลี' },
     { district: 'อำเภอ แม่ลาว', key: 'ตำบล ป่าก่อดำ', name: 'ป่าก่อดำ' },
     { district: 'อำเภอ แม่ลาว', key: 'ตำบล ป่งแพร่', name: 'ป่งแพร่' },

     // อำเภอ เวียงเชียงรุ้ง
     { district: 'อำเภอ เวียงเชียงรุ้ง', key: 'ตำบล ทุ่งก่อ', name: 'ทุ่งก่อ' },
     { district: 'อำเภอ เวียงเชียงรุ้ง', key: 'ตำบล ดงมหาวัน', name: 'ดงมหาวัน' },
     { district: 'อำเภอ เวียงเชียงรุ้ง', key: 'ตำบล ป่าซาง', name: 'ป่าซาง' },

     // อำเภอ ดอยหลวง
     { district: 'อำเภอ ดอยหลวง', key: 'ตำบล ปงน้อย', name: 'ปงน้อย' },
     { district: 'อำเภอ ดอยหลวง', key: 'ตำบล โชคชัย', name: 'โชคชัย' },
     { district: 'อำเภอ ดอยหลวง', key: 'ตำบล หนองป่าก่อ', name: 'หนองป่าก่อ' },
]